
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 28, 28, 27)        702
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 27)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 64)        43264
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 64)          0
_________________________________________________________________
flatten (Flatten)            (None, 3136)              0
_________________________________________________________________
dense (Dense)                (None, 210)               658770
_________________________________________________________________
dense_1 (Dense)              (None, 10)                2110
=================================================================
Total params: 704,846
Trainable params: 704,846
Non-trainable params: 0

Original data analyses:
history {'loss': [0.7275635004043579, 0.04267386719584465, 0.030339105054736137, 0.025165734812617302, 0.0207691453397274, 0.020348014310002327, 0.021504292264580727, 0.02294069342315197, 0.020858705043792725, 0.0199966449290514, 0.021188879385590553, 0.017942991107702255, 0.017910456284880638, 0.019164659082889557, 0.022908952087163925], 'accuracy': [0.9440555572509766, 0.9868147969245911, 0.9902777671813965, 0.9919629693031311, 0.9933888912200928, 0.9939073920249939, 0.9932222366333008, 0.9934629797935486, 0.9938703775405884, 0.9944629669189453, 0.9939073920249939, 0.9950370192527771, 0.9950925707817078, 0.9945370554924011, 0.9937962889671326], 'val_loss': [0.06095043942332268, 0.06658021360635757, 0.05033443868160248, 0.10319218784570694, 0.06402228772640228, 0.06732320040464401, 0.07726716250181198, 0.06532728672027588, 0.0675041675567627, 0.07037787139415741, 0.08524265140295029, 0.07790503650903702, 0.07332424074411392, 0.08160030096769333, 0.11147899180650711], 'val_accuracy': [0.9821666479110718, 0.9798333048820496, 0.9868333339691162, 0.9751666784286499, 0.9850000143051147, 0.9816666841506958, 0.9821666479110718, 0.9860000014305115, 0.9853333234786987, 0.984666645526886, 0.9860000014305115, 0.984666645526886, 0.9861666560173035, 0.9856666922569275, 0.9828333258628845]}

Taxa de Erros: 0.0777
Taxa de Acurácia: 0.9853
Previsões erradas: 147/10000

Normalized data analyses:
history {'loss': [0.7909096479415894, 0.10868190973997116, 0.06533792614936829, 0.04908183962106705, 0.038459472358226776, 0.03167970851063728, 0.02611870877444744, 0.021268444135785103, 0.018925826996564865, 0.017934871837496758, 0.015546875074505806, 0.012209462933242321, 0.013152850791811943, 0.012184159830212593, 0.009848779998719692], 'accuracy': [0.7291111350059509, 0.9672407507896423, 0.9798518419265747, 0.9847221970558167, 0.9877222180366516, 0.9899444580078125, 0.9913889169692993, 0.9930185079574585, 0.9937962889671326, 0.9939814805984497, 0.9950000047683716, 0.9959629774093628, 0.995888888835907, 0.9957407116889954, 0.9965925812721252], 'val_loss': [0.16624978184700012, 0.07375340908765793, 0.06114783138036728, 0.057741571217775345, 0.04549579322338104, 0.04370264336466789, 0.05080486088991165, 0.043677881360054016, 0.0406707338988781, 0.04467257112264633, 0.04743405804038048, 0.05498958379030228, 0.05737422779202461, 0.051375966519117355, 0.05154229328036308], 'val_accuracy': [0.9503333568572998, 0.9775000214576721, 0.9821666479110718, 0.9806666374206543, 0.984499990940094, 0.9856666922569275, 0.9854999780654907, 0.9868333339691162, 0.9865000247955322, 0.987333357334137, 0.9856666922569275, 0.9836666584014893, 0.9856666922569275, 0.9869999885559082, 0.9879999756813049]}

Taxa de Erros: 0.0631
Taxa de Acurácia: 0.9876
Previsões erradas: 124/10000
